-- Adminer 4.6.1 MySQL dump
SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2010`;
CREATE TABLE `kultura_2010` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2010` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES
( '1', 'Пшениця озима', 'Волинська область',        '113.1'),
( '2', 'Пшениця озима', 'Рівненська область',       '96.7'),
( '3', 'Пшениця озима', 'Житомирська область',      '97.7'),
( '4', 'Пшениця озима', 'Київська область',         '201.6'),
( '5', 'Пшениця озима', 'Чернігівська область',     '159.7'),
( '6', 'Пшениця озима', 'Сумська область',          '228.3'),
( '7', 'Пшениця озима', 'Харківська область',       '234.0'),
( '8', 'Пшениця озима', 'Луганська область',        '262.3'),
( '9', 'Пшениця озима', 'Львівська область',        '121.5'),
('10', 'Пшениця озима', 'Тернопільська область',    '199.8'),
('11', 'Пшениця озима', 'Хмельницька область',      '206.0'),
('12', 'Пшениця озима', 'Вінницька область',        '360.7'),
('13', 'Пшениця озима', 'Черкаська область',        '243.3'),
('14', 'Пшениця озима', 'Полтавська область',       '247.2'),
('15', 'Пшениця озима', 'Дніпропетровська область', '481.4'),
('16', 'Пшениця озима', 'Донецька область',         '412.3'),
('17', 'Пшениця озима', 'Закарпатська область',     '26.6'),
('18', 'Пшениця озима', 'Івано-франківська область','44.0'),
('19', 'Пшениця озима', 'Чернівецька область',      '37.2'),
('20', 'Пшениця озима', 'Одеська область',          '472.5'),
('21', 'Пшениця озима', 'Кіровоградська область',   '300.8'),
('22', 'Пшениця озима', 'Миколаївська область',     '367.9'),
('23', 'Пшениця озима', 'Херсонська область',       '377.5'),
('24', 'Пшениця озима', 'АР Крим',                  '370.4'),
('25', 'Пшениця озима', 'Запорізька область',       '483.8'),

('26', 'Пшениця яра', 'Волинська область',        '15.2'),
('27', 'Пшениця яра', 'Рівненська область',       '15.7'),
('28', 'Пшениця яра', 'Житомирська область',      '22.5'),
('29', 'Пшениця яра', 'Київська область',         '41.4'),
('30', 'Пшениця яра', 'Чернігівська область',     '21.6'),
('31', 'Пшениця яра', 'Сумська область',          '18.9'),
('32', 'Пшениця яра', 'Харківська область',       '9.3'),
('33', 'Пшениця яра', 'Луганська область',        '1.0'),
('34', 'Пшениця яра', 'Львівська область',        '22.6'),
('35', 'Пшениця яра', 'Тернопільська область',    '40.7'),
('36', 'Пшениця яра', 'Хмельницька область',      '18.9'),
('37', 'Пшениця яра', 'Вінницька область',        '31.2'),
('38', 'Пшениця яра', 'Черкаська область',        '8.4'),
('39', 'Пшениця яра', 'Полтавська область',       '15.8'),
('40', 'Пшениця яра', 'Дніпропетровська область', '3.8'),
('41', 'Пшениця яра', 'Донецька область',         '2.0'),
('42', 'Пшениця яра', 'Закарпатська область',     '2.2'),
('43', 'Пшениця яра', 'Івано-франківська область','7.8'),
('44', 'Пшениця яра', 'Чернівецька область',      '4.5'),
('45', 'Пшениця яра', 'Одеська область',          '2.0'),
('46', 'Пшениця яра', 'Кіровоградська область',   '2.5'),
('47', 'Пшениця яра', 'Миколаївська область',     '1.2'),
('48', 'Пшениця яра', 'Херсонська область',       '1.5'),
('49', 'Пшениця яра', 'АР Крим',                  '0.8'),
('50', 'Пшениця яра', 'Запорізька область',       '3.4');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2011`;
CREATE TABLE `kultura_2011` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2011` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('51', 'Пшениця озима', 'Волинська область',        '116.5'),
('52', 'Пшениця озима', 'Рівненська область',       '95.5'),
('53', 'Пшениця озима', 'Житомирська область',      '98.5'),
('54', 'Пшениця озима', 'Київська область',         '205.8'),
('55', 'Пшениця озима', 'Чернігівська область',     '159.3'),
('56', 'Пшениця озима', 'Сумська область',          '213.2'),
('57', 'Пшениця озима', 'Харківська область',       '430.5'),
('58', 'Пшениця озима', 'Луганська область',        '285.7'),
('59', 'Пшениця озима', 'Львівська область',        '126.9'),
('60', 'Пшениця озима', 'Тернопільська область',    '184.9'),
('61', 'Пшениця озима', 'Хмельницька область',      '218.8'),
('62', 'Пшениця озима', 'Вінницька область',        '368.8'),
('63', 'Пшениця озима', 'Черкаська область',        '246.0'),
('64', 'Пшениця озима', 'Полтавська область',       '298.3'),
('65', 'Пшениця озима', 'Дніпропетровська область', '481.4'),
('66', 'Пшениця озима', 'Донецька область',         '417.2'),
('67', 'Пшениця озима', 'Закарпатська область',     '31.2'),
('68', 'Пшениця озима', 'Івано-франківська область','49.2'),
('69', 'Пшениця озима', 'Чернівецька область',      '38.3'),
('70', 'Пшениця озима', 'Одеська область',          '471.8'),
('71', 'Пшениця озима', 'Кіровоградська область',   '293.8'),
('72', 'Пшениця озима', 'Миколаївська область',     '398.9'),
('73', 'Пшениця озима', 'Херсонська область',       '443.1'),
('74', 'Пшениця озима', 'АР Крим',                  '350.5'),
('75', 'Пшениця озима', 'Запорізька область',       '481.9'),

('76', 'Пшениця яра', 'Волинська область',        '13.4'),
('77', 'Пшениця яра', 'Рівненська область',       '13.4'),
('78', 'Пшениця яра', 'Житомирська область',      '23.8'),
('79', 'Пшениця яра', 'Київська область',         '30.2'),
('80', 'Пшениця яра', 'Чернігівська область',     '18.2'),
('81', 'Пшениця яра', 'Сумська область',          '16.1'),
('82', 'Пшениця яра', 'Харківська область',       '4.0'),
('83', 'Пшениця яра', 'Луганська область',        '0.4'),
('84', 'Пшениця яра', 'Львівська область',        '26.6'),
('85', 'Пшениця яра', 'Тернопільська область',    '41.4'),
('86', 'Пшениця яра', 'Хмельницька область',      '18.5'),
('87', 'Пшениця яра', 'Вінницька область',        '25.7'),
('88', 'Пшениця яра', 'Черкаська область',        '9.0'),
('89', 'Пшениця яра', 'Полтавська область',       '8.9'),
('90', 'Пшениця яра', 'Дніпропетровська область', '5.7'),
('91', 'Пшениця яра', 'Донецька область',         '2.6'),
('92', 'Пшениця яра', 'Закарпатська область',     '2.8'),
('93', 'Пшениця яра', 'Івано-франківська область','7.3'),
('94', 'Пшениця яра', 'Чернівецька область',      '3.0'),
('95', 'Пшениця яра', 'Одеська область',          '1.7'),
('96', 'Пшениця яра', 'Кіровоградська область',   '2.1'),
('97', 'Пшениця яра', 'Миколаївська область',     '2.1'),
('98', 'Пшениця яра', 'Херсонська область',       '2.0'),
('99', 'Пшениця яра', 'АР Крим',                  '1.0'),
('100','Пшениця яра', 'Запорізька область',       '4.3');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2012`;
CREATE TABLE `kultura_2012` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2012` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('101', 'Пшениця озима', 'Волинська область',        '121.5'),
('102', 'Пшениця озима', 'Рівненська область',       '96.7'),
('103', 'Пшениця озима', 'Житомирська область',      '96.5'),
('104', 'Пшениця озима', 'Київська область',         '179.3'),
('105', 'Пшениця озима', 'Чернігівська область',     '142.9'),
('106', 'Пшениця озима', 'Сумська область',          '187.9'),
('107', 'Пшениця озима', 'Харківська область',       '352.4'),
('108', 'Пшениця озима', 'Луганська область',        '296.2'),
('109', 'Пшениця озима', 'Львівська область',        '137.3'),
('110', 'Пшениця озима', 'Тернопільська область',    '207.3'),
('111', 'Пшениця озима', 'Хмельницька область',      '218.3'),
('112', 'Пшениця озима', 'Вінницька область',        '347.7'),
('113', 'Пшениця озима', 'Черкаська область',        '215.7'),
('114', 'Пшениця озима', 'Полтавська область',       '198.4'),
('115', 'Пшениця озима', 'Дніпропетровська область', '338.6'),
('116', 'Пшениця озима', 'Донецька область',         '402.2'),
('117', 'Пшениця озима', 'Закарпатська область',     '34.5'),
('118', 'Пшениця озима', 'Івано-франківська область','50.0'),
('119', 'Пшениця озима', 'Чернівецька область',      '43.6'),
('120', 'Пшениця озима', 'Одеська область',          '444.4'),
('121', 'Пшениця озима', 'Кіровоградська область',   '217.1'),
('122', 'Пшениця озима', 'Миколаївська область',     '249.4'),
('123', 'Пшениця озима', 'Херсонська область',       '243.0'),
('124', 'Пшениця озима', 'АР Крим',                  '313.3'),
('125', 'Пшениця озима', 'Запорізька область',       '417.5'),

('126', 'Пшениця яра', 'Волинська область',        '17.5'),
('127', 'Пшениця яра', 'Рівненська область',       '12.5'),
('128', 'Пшениця яра', 'Житомирська область',      '17.8'),
('129', 'Пшениця яра', 'Київська область',         '21.1'),
('130', 'Пшениця яра', 'Чернігівська область',     '8.9'),
('131', 'Пшениця яра', 'Сумська область',          '7.8'),
('132', 'Пшениця яра', 'Харківська область',       '7.0'),
('133', 'Пшениця яра', 'Луганська область',        '2.0'),
('134', 'Пшениця яра', 'Львівська область',        '21.3'),
('135', 'Пшениця яра', 'Тернопільська область',    '34.3'),
('136', 'Пшениця яра', 'Хмельницька область',      '17.7'),
('137', 'Пшениця яра', 'Вінницька область',        '17.5'),
('138', 'Пшениця яра', 'Черкаська область',        '5.8'),
('139', 'Пшениця яра', 'Полтавська область',       '9.3'),
('140', 'Пшениця яра', 'Дніпропетровська область', '7.5'),
('141', 'Пшениця яра', 'Донецька область',         '2.7'),
('142', 'Пшениця яра', 'Закарпатська область',     '2.5'),
('143', 'Пшениця яра', 'Івано-франківська область','8.6'),
('144', 'Пшениця яра', 'Чернівецька область',      '4.2'),
('145', 'Пшениця яра', 'Одеська область',          '3.5'),
('146', 'Пшениця яра', 'Кіровоградська область',   '2.9'),
('147', 'Пшениця яра', 'Миколаївська область',     '5.8'),
('148', 'Пшениця яра', 'Херсонська область',       '2.0'),
('149', 'Пшениця яра', 'АР Крим',                  '0.6'),
('150', 'Пшениця яра', 'Запорізька область',       '4.8');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2013`;
CREATE TABLE `kultura_2013` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2013` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('151', 'Пшениця озима', 'Волинська область',        '122.2'),
('152', 'Пшениця озима', 'Рівненська область',       '95.6'),
('153', 'Пшениця озима', 'Житомирська область',      '95.9'),
('154', 'Пшениця озима', 'Київська область',         '177.3'),
('155', 'Пшениця озима', 'Чернігівська область',     '143.7'),
('156', 'Пшениця озима', 'Сумська область',          '194.1'),
('157', 'Пшениця озима', 'Харківська область',       '461.9'),
('158', 'Пшениця озима', 'Луганська область',        '298.9'),
('159', 'Пшениця озима', 'Львівська область',        '144.1'),
('160', 'Пшениця озима', 'Тернопільська область',    '177.9'),
('161', 'Пшениця озима', 'Хмельницька область',      '202.9'),
('162', 'Пшениця озима', 'Вінницька область',        '345.2'),
('163', 'Пшениця озима', 'Черкаська область',        '204.5'),
('164', 'Пшениця озима', 'Полтавська область',       '250.8'),
('165', 'Пшениця озима', 'Дніпропетровська область', '524.9'),
('166', 'Пшениця озима', 'Донецька область',         '432.0'),
('167', 'Пшениця озима', 'Закарпатська область',     '33.5'),
('168', 'Пшениця озима', 'Івано-франківська область','58.1'),
('169', 'Пшениця озима', 'Чернівецька область',      '45.0'),
('170', 'Пшениця озима', 'Одеська область',          '503.9'),
('171', 'Пшениця озима', 'Кіровоградська область',   '267.3'),
('172', 'Пшениця озима', 'Миколаївська область',     '399.4'),
('173', 'Пшениця озима', 'Херсонська область',       '431.1'),
('174', 'Пшениця озима', 'АР Крим',                  '240.7'),
('175', 'Пшениця озима', 'Запорізька область',       '562.9'),

('176', 'Пшениця яра', 'Волинська область',        '10.1'),
('177', 'Пшениця яра', 'Рівненська область',       '8.5'),
('178', 'Пшениця яра', 'Житомирська область',      '11.0'),
('179', 'Пшениця яра', 'Київська область',         '10.2'),
('180', 'Пшениця яра', 'Чернігівська область',     '4.4'),
('181', 'Пшениця яра', 'Сумська область',          '4.8'),
('182', 'Пшениця яра', 'Харківська область',       '5.7'),
('183', 'Пшениця яра', 'Луганська область',        '1.9'),
('184', 'Пшениця яра', 'Львівська область',        '18.5'),
('185', 'Пшениця яра', 'Тернопільська область',    '20.0'),
('186', 'Пшениця яра', 'Хмельницька область',      '9.8'),
('187', 'Пшениця яра', 'Вінницька область',        '10.1'),
('188', 'Пшениця яра', 'Черкаська область',        '3.4'),
('189', 'Пшениця яра', 'Полтавська область',       '3.8'),
('190', 'Пшениця яра', 'Дніпропетровська область', '2.5'),
('191', 'Пшениця яра', 'Донецька область',         '2.6'),
('192', 'Пшениця яра', 'Закарпатська область',     '2.2'),
('193', 'Пшениця яра', 'Івано-франківська область','4.8'),
('194', 'Пшениця яра', 'Чернівецька область',      '3.1'),
('195', 'Пшениця яра', 'Одеська область',          '1.8'),
('196', 'Пшениця яра', 'Кіровоградська область',   '3.0'),
('197', 'Пшениця яра', 'Миколаївська область',     '2.3'),
('198', 'Пшениця яра', 'Херсонська область',       '1.2'),
('199', 'Пшениця яра', 'АР Крим',                  '1.7'),
('200', 'Пшениця яра', 'Запорізька область',       '4.6');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2014`;
CREATE TABLE `kultura_2014` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2014` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('201', 'Пшениця озима', 'Волинська область',        '130.4'),
('202', 'Пшениця озима', 'Рівненська область',       '95.2'),
('203', 'Пшениця озима', 'Житомирська область',      '86.4'),
('204', 'Пшениця озима', 'Київська область',         '177.3'),
('205', 'Пшениця озима', 'Чернігівська область',     '153.5'),
('206', 'Пшениця озима', 'Сумська область',          '171.3'),
('207', 'Пшениця озима', 'Харківська область',       '401.8'),
('208', 'Пшениця озима', 'Луганська область',        '271.8'),
('209', 'Пшениця озима', 'Львівська область',        '140.0'),
('210', 'Пшениця озима', 'Тернопільська область',    '180.4'),
('211', 'Пшениця озима', 'Хмельницька область',      '191.5'),
('212', 'Пшениця озима', 'Вінницька область',        '319.8'),
('213', 'Пшениця озима', 'Черкаська область',        '208.1'),
('214', 'Пшениця озима', 'Полтавська область',       '219.6'),
('215', 'Пшениця озима', 'Дніпропетровська область', '483.8'),
('216', 'Пшениця озима', 'Донецька область',         '390.1'),
('217', 'Пшениця озима', 'Закарпатська область',     '34.1'),
('218', 'Пшениця озима', 'Івано-франківська область','63.1'),
('219', 'Пшениця озима', 'Чернівецька область',      '40.1'),
('220', 'Пшениця озима', 'Одеська область',          '543.0'),
('221', 'Пшениця озима', 'Кіровоградська область',   '241.3'),
('222', 'Пшениця озима', 'Миколаївська область',     '401.9'),
('223', 'Пшениця озима', 'Херсонська область',       '476.0'),
('224', 'Пшениця озима', 'АР Крим',                  '0.0'),
('225', 'Пшениця озима', 'Запорізька область',       '560.0'),

('226', 'Пшениця яра', 'Волинська область',        '9.5'),
('227', 'Пшениця яра', 'Рівненська область',       '6.4'),
('228', 'Пшениця яра', 'Житомирська область',      '12.2'),
('229', 'Пшениця яра', 'Київська область',         '12.4'),
('230', 'Пшениця яра', 'Чернігівська область',     '3.4'),
('231', 'Пшениця яра', 'Сумська область',          '6.2'),
('232', 'Пшениця яра', 'Харківська область',       '9.6'),
('233', 'Пшениця яра', 'Луганська область',        '2.0'),
('234', 'Пшениця яра', 'Львівська область',        '21.4'),
('235', 'Пшениця яра', 'Тернопільська область',    '18.1'),
('236', 'Пшениця яра', 'Хмельницька область',      '6.9'),
('237', 'Пшениця яра', 'Вінницька область',        '21.2'),
('238', 'Пшениця яра', 'Черкаська область',        '2.6'),
('239', 'Пшениця яра', 'Полтавська область',       '4.5'),
('240', 'Пшениця яра', 'Дніпропетровська область', '3.6'),
('241', 'Пшениця яра', 'Донецька область',         '3.2'),
('242', 'Пшениця яра', 'Закарпатська область',     '1.8'),
('243', 'Пшениця яра', 'Івано-франківська область','6.1'),
('244', 'Пшениця яра', 'Чернівецька область',      '1.3'),
('245', 'Пшениця яра', 'Одеська область',          '2.6'),
('246', 'Пшениця яра', 'Кіровоградська область',   '1.6'),
('247', 'Пшениця яра', 'Миколаївська область',     '1.8'),
('248', 'Пшениця яра', 'Херсонська область',       '2.0'),
('249', 'Пшениця яра', 'АР Крим',                  '0.0'),
('250', 'Пшениця яра', 'Запорізька область',       '3.6');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2015`;
CREATE TABLE `kultura_2015` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2015` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('251', 'Пшениця озима', 'Волинська область',        '134.3'),
('252', 'Пшениця озима', 'Рівненська область',       '96.2'),
('253', 'Пшениця озима', 'Житомирська область',      '107.3'),
('254', 'Пшениця озима', 'Київська область',         '195.3'),
('255', 'Пшениця озима', 'Чернігівська область',     '194.1'),
('256', 'Пшениця озима', 'Сумська область',          '243.8'),
('257', 'Пшениця озима', 'Харківська область',       '547.9'),
('258', 'Пшениця озима', 'Луганська область',        '239.7'),
('259', 'Пшениця озима', 'Львівська область',        '155.3'),
('260', 'Пшениця озима', 'Тернопільська область',    '184.2'),
('261', 'Пшениця озима', 'Хмельницька область',      '206.3'),
('262', 'Пшениця озима', 'Вінницька область',        '364.6'),
('263', 'Пшениця озима', 'Черкаська область',        '249.5'),
('264', 'Пшениця озима', 'Полтавська область',       '290.2'),
('265', 'Пшениця озима', 'Дніпропетровська область', '579.3'),
('266', 'Пшениця озима', 'Донецька область',         '327.2'),
('267', 'Пшениця озима', 'Закарпатська область',     '31.8'),
('268', 'Пшениця озима', 'Івано-франківська область','65.4'),
('269', 'Пшениця озима', 'Чернівецька область',      '41.6'),
('270', 'Пшениця озима', 'Одеська область',          '567.4'),
('271', 'Пшениця озима', 'Кіровоградська область',   '304.3'),
('272', 'Пшениця озима', 'Миколаївська область',     '424.4'),
('273', 'Пшениця озима', 'Херсонська область',       '494.3'),
('274', 'Пшениця озима', 'АР Крим',                  '0.0'),
('275', 'Пшениця озима', 'Запорізька область',       '625.7'),

('276', 'Пшениця яра', 'Волинська область',        '11.2'),
('277', 'Пшениця яра', 'Рівненська область',       '6.9'),
('278', 'Пшениця яра', 'Житомирська область',      '12.5'),
('279', 'Пшениця яра', 'Київська область',         '11.3'),
('280', 'Пшениця яра', 'Чернігівська область',     '6.0'),
('281', 'Пшениця яра', 'Сумська область',          '5.2'),
('282', 'Пшениця яра', 'Харківська область',       '11.0'),
('283', 'Пшениця яра', 'Луганська область',        '1.0'),
('284', 'Пшениця яра', 'Львівська область',        '25.2'),
('285', 'Пшениця яра', 'Тернопільська область',    '16.6'),
('286', 'Пшениця яра', 'Хмельницька область',      '7.9'),
('287', 'Пшениця яра', 'Вінницька область',        '12.4'),
('288', 'Пшениця яра', 'Черкаська область',        '5.1'),
('289', 'Пшениця яра', 'Полтавська область',       '6.0'),
('290', 'Пшениця яра', 'Дніпропетровська область', '6.1'),
('291', 'Пшениця яра', 'Донецька область',         '2.0'),
('292', 'Пшениця яра', 'Закарпатська область',     '1.6'),
('293', 'Пшениця яра', 'Івано-франківська область','4.9'),
('294', 'Пшениця яра', 'Чернівецька область',      '1.8'),
('295', 'Пшениця яра', 'Одеська область',          '2.3'),
('296', 'Пшениця яра', 'Кіровоградська область',   '3.1'),
('297', 'Пшениця яра', 'Миколаївська область',     '2.1'),
('298', 'Пшениця яра', 'Херсонська область',       '2.8'),
('299', 'Пшениця яра', 'АР Крим',                  '0.0'),
('300', 'Пшениця яра', 'Запорізька область',       '4.4');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2016`;
CREATE TABLE `kultura_2016` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2016` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('301', 'Пшениця озима', 'Волинська область',        '145.1'),
('302', 'Пшениця озима', 'Рівненська область',       '95.3'),
('303', 'Пшениця озима', 'Житомирська область',      '124.5'),
('304', 'Пшениця озима', 'Київська область',         '196.5'),
('305', 'Пшениця озима', 'Чернігівська область',     '195.7'),
('306', 'Пшениця озима', 'Сумська область',          '217.4'),
('307', 'Пшениця озима', 'Харківська область',       '450.3'),
('308', 'Пшениця озима', 'Луганська область',        '216.7'),
('309', 'Пшениця озима', 'Львівська область',        '152.1'),
('310', 'Пшениця озима', 'Тернопільська область',    '200.7'),
('311', 'Пшениця озима', 'Хмельницька область',      '234.4'),
('312', 'Пшениця озима', 'Вінницька область',        '384.2'),
('313', 'Пшениця озима', 'Черкаська область',        '227.9'),
('314', 'Пшениця озима', 'Полтавська область',       '248.6'),
('315', 'Пшениця озима', 'Дніпропетровська область', '420.3'),
('316', 'Пшениця озима', 'Донецька область',         '319.1'),
('317', 'Пшениця озима', 'Закарпатська область',     '29.5'),
('318', 'Пшениця озима', 'Івано-франківська область','55.9'),
('319', 'Пшениця озима', 'Чернівецька область',      '45.2'),
('320', 'Пшениця озима', 'Одеська область',          '543.9'),
('321', 'Пшениця озима', 'Кіровоградська область',   '270.0'),
('322', 'Пшениця озима', 'Миколаївська область',     '332.7'),
('323', 'Пшениця озима', 'Херсонська область',       '360.0'),
('324', 'Пшениця озима', 'АР Крим',                  '0.0'),
('325', 'Пшениця озима', 'Запорізька область',       '536.5'),

('326', 'Пшениця яра', 'Волинська область',        '16.9'),
('327', 'Пшениця яра', 'Рівненська область',       '8.1'),
('328', 'Пшениця яра', 'Житомирська область',      '13.3'),
('329', 'Пшениця яра', 'Київська область',         '12.8'),
('330', 'Пшениця яра', 'Чернігівська область',     '4.8'),
('331', 'Пшениця яра', 'Сумська область',          '4.1'),
('332', 'Пшениця яра', 'Харківська область',       '10.9'),
('333', 'Пшениця яра', 'Луганська область',        '2.1'),
('334', 'Пшениця яра', 'Львівська область',        '21.2'),
('335', 'Пшениця яра', 'Тернопільська область',    '19.5'),
('336', 'Пшениця яра', 'Хмельницька область',      '11.0'),
('337', 'Пшениця яра', 'Вінницька область',        '12.9'),
('338', 'Пшениця яра', 'Черкаська область',        '5.6'),
('339', 'Пшениця яра', 'Полтавська область',       '5.2'),
('340', 'Пшениця яра', 'Дніпропетровська область', '9.5'),
('341', 'Пшениця яра', 'Донецька область',         '1.8'),
('342', 'Пшениця яра', 'Закарпатська область',     '1.5'),
('343', 'Пшениця яра', 'Івано-франківська область','4.9'),
('344', 'Пшениця яра', 'Чернівецька область',      '1.4'),
('345', 'Пшениця яра', 'Одеська область',          '5.3'),
('346', 'Пшениця яра', 'Кіровоградська область',   '4.0'),
('347', 'Пшениця яра', 'Миколаївська область',     '3.6'),
('348', 'Пшениця яра', 'Херсонська область',       '1.7'),
('349', 'Пшениця яра', 'АР Крим',                  '0.0'),
('350', 'Пшениця яра', 'Запорізька область',       '4.5');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2017`;
CREATE TABLE `kultura_2017` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2017` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('351', 'Пшениця озима', 'Волинська область',        '139.8'),
('352', 'Пшениця озима', 'Рівненська область',       '93.5'),
('353', 'Пшениця озима', 'Житомирська область',      '113.8'),
('354', 'Пшениця озима', 'Київська область',         '193.7'),
('355', 'Пшениця озима', 'Чернігівська область',     '187.8'),
('356', 'Пшениця озима', 'Сумська область',          '198.5'),
('357', 'Пшениця озима', 'Харківська область',       '471.0'),
('358', 'Пшениця озима', 'Луганська область',        '242.0'),
('359', 'Пшениця озима', 'Львівська область',        '136.1'),
('360', 'Пшениця озима', 'Тернопільська область',    '179.3'),
('361', 'Пшениця озима', 'Хмельницька область',      '209.0'),
('362', 'Пшениця озима', 'Вінницька область',        '328.1'),
('363', 'Пшениця озима', 'Черкаська область',        '192.2'),
('364', 'Пшениця озима', 'Полтавська область',       '236.5'),
('365', 'Пшениця озима', 'Дніпропетровська область', '482.8'),
('366', 'Пшениця озима', 'Донецька область',         '309.8'),
('367', 'Пшениця озима', 'Закарпатська область',     '27.1'),
('368', 'Пшениця озима', 'Івано-франківська область','48.7'),
('369', 'Пшениця озима', 'Чернівецька область',      '36.8'),
('370', 'Пшениця озима', 'Одеська область',          '586.3'),
('371', 'Пшениця озима', 'Кіровоградська область',   '263.1'),
('372', 'Пшениця озима', 'Миколаївська область',     '405.7'),
('373', 'Пшениця озима', 'Херсонська область',       '467.8'),
('374', 'Пшениця озима', 'АР Крим',                  '0.0'),
('375', 'Пшениця озима', 'Запорізька область',       '619.3'),

('376', 'Пшениця яра', 'Волинська область',        '13.7'),
('377', 'Пшениця яра', 'Рівненська область',       '8.2'),
('378', 'Пшениця яра', 'Житомирська область',      '15.2'),
('379', 'Пшениця яра', 'Київська область',         '14.9'),
('380', 'Пшениця яра', 'Чернігівська область',     '4.2'),
('381', 'Пшениця яра', 'Сумська область',          '2.7'),
('382', 'Пшениця яра', 'Харківська область',       '9.6'),
('383', 'Пшениця яра', 'Луганська область',        '1.7'),
('384', 'Пшениця яра', 'Львівська область',        '24.8'),
('385', 'Пшениця яра', 'Тернопільська область',    '20.8'),
('386', 'Пшениця яра', 'Хмельницька область',      '13.2'),
('387', 'Пшениця яра', 'Вінницька область',        '15.2'),
('388', 'Пшениця яра', 'Черкаська область',        '7.2'),
('389', 'Пшениця яра', 'Полтавська область',       '4.2'),
('390', 'Пшениця яра', 'Дніпропетровська область', '10.2'),
('391', 'Пшениця яра', 'Донецька область',         '2.4'),
('392', 'Пшениця яра', 'Закарпатська область',     '1.4'),
('393', 'Пшениця яра', 'Івано-франківська область','7.5'),
('394', 'Пшениця яра', 'Чернівецька область',      '3.3'),
('395', 'Пшениця яра', 'Одеська область',          '4.6'),
('396', 'Пшениця яра', 'Кіровоградська область',   '3.9'),
('397', 'Пшениця яра', 'Миколаївська область',     '3.7'),
('398', 'Пшениця яра', 'Херсонська область',       '3.0'),
('399', 'Пшениця яра', 'АР Крим',                  '0.0'),
('400', 'Пшениця яра', 'Запорізька область',       '4.0');

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `kultura_2018`;
CREATE TABLE `kultura_2018` (
  `id_kultura` int NOT NULL,
  `name_kultura` varchar(32) DEFAULT NULL,
  `region` varchar(32) DEFAULT NULL,
  `crop_area` float DEFAULT NULL,
  PRIMARY KEY (`id_kultura`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Ідентифікатори культур з указанням посівної площі';

INSERT INTO `kultura_2018` (`id_kultura`, `name_kultura`, `region`, `crop_area`) VALUES

('401', 'Пшениця озима', 'Волинська область',        '143.1'),
('402', 'Пшениця озима', 'Рівненська область',       '94.9'),
('403', 'Пшениця озима', 'Житомирська область',      '128.9'),
('404', 'Пшениця озима', 'Київська область',         '176.9'),
('405', 'Пшениця озима', 'Чернігівська область',     '184.9'),
('406', 'Пшениця озима', 'Сумська область',          '177.6'),
('407', 'Пшениця озима', 'Харківська область',       '518.0'),
('408', 'Пшениця озима', 'Луганська область',        '271.3'),
('409', 'Пшениця озима', 'Львівська область',        '146.4'),
('410', 'Пшениця озима', 'Тернопільська область',    '185.1'),
('411', 'Пшениця озима', 'Хмельницька область',      '217.9'),
('412', 'Пшениця озима', 'Вінницька область',        '314.7'),
('413', 'Пшениця озима', 'Черкаська область',        '196.6'),
('414', 'Пшениця озима', 'Полтавська область',       '232.3'),
('415', 'Пшениця озима', 'Дніпропетровська область', '508.8'),
('416', 'Пшениця озима', 'Донецька область',         '334.5'),
('417', 'Пшениця озима', 'Закарпатська область',     '26.1'),
('418', 'Пшениця озима', 'Івано-франківська область','63.1'),
('419', 'Пшениця озима', 'Чернівецька область',      '39.2'),
('420', 'Пшениця озима', 'Одеська область',          '628.3'),
('421', 'Пшениця озима', 'Кіровоградська область',   '295.2'),
('422', 'Пшениця озима', 'Миколаївська область',     '432.2'),
('423', 'Пшениця озима', 'Херсонська область',       '469.4'),
('424', 'Пшениця озима', 'АР Крим',                  '0.0'),
('425', 'Пшениця озима', 'Запорізька область',       '635.4'),

('426', 'Пшениця яра', 'Волинська область',        '13.8'),
('427', 'Пшениця яра', 'Рівненська область',       '9.2'),
('428', 'Пшениця яра', 'Житомирська область',      '17.9'),
('429', 'Пшениця яра', 'Київська область',         '13.8'),
('430', 'Пшениця яра', 'Чернігівська область',     '6.6'),
('431', 'Пшениця яра', 'Сумська область',          '4.0'),
('432', 'Пшениця яра', 'Харківська область',       '11.2'),
('433', 'Пшениця яра', 'Луганська область',        '1.7'),
('434', 'Пшениця яра', 'Львівська область',        '24.5'),
('435', 'Пшениця яра', 'Тернопільська область',    '17.0'),
('436', 'Пшениця яра', 'Хмельницька область',      '12.5'),
('437', 'Пшениця яра', 'Вінницька область',        '10.2'),
('438', 'Пшениця яра', 'Черкаська область',        '7.6'),
('439', 'Пшениця яра', 'Полтавська область',       '4.1'),
('440', 'Пшениця яра', 'Дніпропетровська область', '8.3'),
('441', 'Пшениця яра', 'Донецька область',         '2.5'),
('442', 'Пшениця яра', 'Закарпатська область',     '1.5'),
('443', 'Пшениця яра', 'Івано-франківська область','8.8'),
('444', 'Пшениця яра', 'Чернівецька область',      '6.6'),
('445', 'Пшениця яра', 'Одеська область',          '5.1'),
('446', 'Пшениця яра', 'Кіровоградська область',   '4.0'),
('447', 'Пшениця яра', 'Миколаївська область',     '3.1'),
('448', 'Пшениця яра', 'Херсонська область',       '2.8'),
('449', 'Пшениця яра', 'АР Крим',                  '0.0'),
('450', 'Пшениця яра', 'Запорізька область',       '3.8');

-- 2019-03-15 11:51:50
